In [1]:
import pandas as pd

Loading  the cleaned Silver Dataset

In [2]:
orders = pd.read_parquet('C:/Users/asus/Downloads/Project.de/Silver/silver_orders.parquet')

In [3]:
customers = pd.read_parquet('C:/Users/asus/Downloads/Project.de/Silver/silver_customers.parquet')

In [4]:
Items = pd.read_parquet('C:/Users/asus/Downloads/Project.de/Silver/silver_items.parquett')

In [6]:
orders.head()

  order_id customer_id   amount      status                       created_at
0   A00001      C00850  1442.80     shipped 2025-12-22 14:27:19.903124+00:00
1   A00002      C01003  1103.33   cancelled 2026-02-11 14:41:30.903124+00:00
2   A00003      C00490    70.45  processing 2026-01-14 02:52:25.903124+00:00
3   A00004      C00969  1916.48  processing 2026-01-27 01:47:19.903124+00:00
4   A00005      C00902   660.26     shipped 2025-11-29 06:50:01.903124+00:00

In [7]:
customers.head()

  customer_id       city
0      C00001   Nürnberg
1      C00002    Hamburg
2      C00003     Berlin
3      C00004     Bremen
4      C00005  Frankfurt

Join order table with Customers to get order_city

In [9]:
order_city = orders.merge(customers, on='customer_id',how="left")

# Revenue per city

In [12]:
Revenue_city = ( order_city
            .groupby('city', as_index = False)['amount']
            .sum()
            .rename(columns={"amount": "Revenue"})
            .sort_values("Revenue",ascending=False)
    
)

In [13]:
Revenue_city.head()

         city    Revenue
4   Frankfurt  748086.91
7        Köln  677401.28
10   Nürnberg  675583.78
1      Bremen  666672.78
5     Hamburg  654666.51

# Daily orders

In [18]:
orders['Date'] = pd.to_datetime(orders['created_at'], errors='coerce').dt.date

In [19]:
Daily_orders = (orders
            .groupby('Date',as_index=False)['order_id']
            .count()
            .rename(columns={'order_id':'Order_Count'})
            .sort_values('Date')
    
)

In [20]:
Daily_orders.head()

         Date  Order_Count
0  2025-11-19           32
1  2025-11-20           94
2  2025-11-21           94
3  2025-11-22           82
4  2025-11-23           75

In [21]:
Items.head()

  order_id  sku  qty   price
0   A00001   S1    3  147.95
1   A00001  S10    5  199.79
2   A00002   S9    4   75.57
3   A00002   S9    5   81.67
4   A00002   S6    2  196.35

# Top products by quantity

In [27]:
Top_product = (Items.groupby('sku', as_index= False)['qty']
                    .sum()
                    .rename(columns={'qty': 'Total_qty'})
                    .sort_values('Total_qty', ascending = False)
)

In [28]:
Top_product.head()

   sku  Total_qty
7   S7       7493
9   S9       7335
1  S10       7275
2   S2       7240
3   S3       7176

# Saving the data in gold folder for the further visuallisation

In [33]:
Top_product.to_csv(r"C:\Users\asus\Downloads\Project.de\Gold\Revenue_city.csv", index=False)
Daily_orders.to_csv(r"C:\Users\asus\Downloads\Project.de\Gold\Daily_orders.csv", index=False)
Top_product.to_csv(r"C:\Users\asus\Downloads\Project.de\Gold\Top_product.csv", index=False)